#!/usr/bin/env python
# coding: utf-8

# In[1]:


#الشمال


north=[
   
"الربيع",
"الندى",
"الصحافة",
"النرجس",
"العارض",
"النفل",
"العقيق",
"الوادي",
"الغدير",
"الياسمين",
"الفلاح",
'الخير',
"بنبان",
"القيروان",
"حطين",
"الملقا",
'المحمدية',
 "العليا",
"السليمانية",
"الملك عبدالعزيز ",
 "الملك عبدالله",
"الورود",
"صلاح الدين",
"الملك فهد",
"المرسلات",
"النزهة",
"المغرزات",
"المروج",
"المصيف",
"التعاون",
"الإزدهار",
'العارض',
'جامعة الملك سعود',
'النخيل',
'الرحمانية'
    ]


north = [item.strip() for item in north]


# In[2]:


#الشرق

east=[
     
"النسيم الشرقي"
"النسيم الغربي",
 'الربوة',
"السلام",
"الريان",
"الروابي",
"النظيم",
"المنار",
"الندوة",
'المعيزيلة',
"خشم العان",
'الحمراء',
"الدفاع",
"المناخ",
"السلي",
"النور",
"الإسكان",
"الصناعية الجديدة" ,
"الفيحاء",
"الجزيرة",
"السعادة",
"هيت",
"البرية",
"المشاعل",
'مطار الملك خالد الدولي',
     
'الشرق',
'الغنامية',
 'الرماية',
 'الجنادرية',
 'الندوة',
 'المرجان',
 'الوسام',
 'البيان',
 'الرحاب',
 'النخبة',
 'المشرق',
 'التضامن',
 'الزاهر',
 'العلا',
' الشعلة',
' الزهور',
' الرسالة',
' الراية',
' المجد',
'النسيم الغربي',
'النسيم الشرقي',
' الدانة',
' الفرسان',
' السحاب',
 'اشبيلية',
 'غرناطة',
 'الشهداء',
 'النهضة',
 'الروضة',
 'الأندلس',
 'الاندلس',
 'الخليج',
 'قرطبة',
 'اليرموك',
 'الرمال',
 'الملك فيصل',
 'القدس',
 'القادسية',
 'المعزيلة',
 'المونسية',
'الجزيرة',
 'النور',
 'الفيحاء',
 'الدفاع',
 'المناخ',
 'السلي',
 'البرية',
 'المشاعل',
 'المناخ',
 'الإسكان',
 'السعادة',
'السلام',
'الروابي',
'الصفا',
'النظيم'
     
    ]


east = [item.strip() for item in east]


# In[3]:


#الغرب

west=[
"السويدي"  
"ظهرة البديعة" ,
"سلطانة"  ,
"الدريهمية",  
"العريجاء الوسطى"  ,
"العريجاء"  ,
"السويدي الغربي" ,
"العريجاء الغربي",
  "شبرا" ,
"لبن"  ,
"الخزامي",
  "السفارات",
 "المهدي" ,
 "ظهرة لبن" ,
    'الزهرة',
 "العوالي" ,
 "نمار" ,
 "طويق" ,
 "ديراب" ,
 "ضاحية نمار" ,
  "المؤتمرات" ,
 "النموذجية" ,
 "الشميسي" ,
 "صياح" ,
 "أم سليم" ,
    'هجرة لبن',
 "البديعة" ,
"الوشام",
"الناصرية" ,
"عليشة" ,
 "الرفيعة",
 "المعذر" ,
 "الفاخرية",
 "الجرادية",
 "الشرفية" ,
 "الهدا" ,
 "الزهرة"
'الازدهار',
'الزهراء',
'ام الحمام الغربي',
'أم الحمام الغربي',
'السويدي',
'سلطانة',
'العريجاء',
 'شبرا',
 'لبن',
'ظهرة لبن',
'الخزامي',
'السفارات',
'المهدي',
'العوالي',
'نمار',
'طويق',
'ديراب',
 'ظهرة نمار',
 'ضاحية نمار',
 'المهدية',
 'ظهرةالبديعة'
    
]

west=[item.strip() for item in west]


# In[4]:


#الجنوب
south=[
   'الشفاء', 
    'الشفا',
    'بدر',
    'المروة',
    'الفواز',
    'منفوحة',
    'الحزم',
    'الغزيزية', 
    'الدار البيضاء',
    'المنصورة',
    'نمار',
    'شبرا',
    'منفوحة الجديدة',
    'اليمامة',
     'المصانع', 
    'المصفاة',
    'طيبة',
    'الفاروق',
    'بن تركي',
    'السويدي' ,
    'الشميسي' ,
    'الحاير' ,
    'الشعلان',
    'الجنوب',
    'عكاظ',
    'عريض',
    'الحائر',
    'الصناعية القديمة'
    
]

south = [item.strip() for item in south]


# In[5]:


center=[
    'المربع',
     'المرقب', 
    'البطحاء',
    'الديرة' ,
    'الصالحية',
    'الملز' ,
    'الضباط',
    'الفاخرية',
    'الخالدية',
    'المنصورية',
    'ام سليم',
    'الوزارات',
    'جرير'
]

center = [item.strip() for item in center]

